@extends('layouts.home')
@section('content')
<div class="container text-center" style="line-height:40px">
<h3>من نحن </h3>
<div class="paragraph col-md-8" dir="rtl">
حول واصل
مرحبًا بكم في واصل ، الوجهة السودانيه الأكثر حداثة عبر الإنترنت   للاواني المنزليه والكهربائيه وادوات التجميل ومسلتزمات المطبخ وكل ما تحتاجينه لمنزلك  . نحن في واصل نضمن لعملائنا الرضا والراحة أثناء التسوق ، وهذا هو السبب في أننا نعد بأحدث الاتجاهات والعلامات التجارية ومستويات الخدمة العالية من خلال فريق إشراك العملاء المذهل. من خلال الشحن  الخاص بنا خلال ما لا يزيد عن 3 أيام ، نؤمن بجعل تجربة التسوق الخاصة بك سعيدة ومريحة.  
 
. خدمات العملاء

خدمة العملاء على الهاتف

موظفونا في المكتب متاحون للإجابة على استفسارات العملاء خلال ساعات العمل. علاوة على ذلك ، يظلون على اتصال مع كل عميل ويحافظون على تحديثه بأوضاع الطلب ووقت التسليم.
موقع خدمة فيسبوك

إن الأهمية الكبيرة لوسائل التواصل الاجتماعي ، ولا سيما Facebook في الوصول إلى قطاع كبير من الأشخاص المهتمين بالشراء عبر الإنترنت ، يقودنا إلى تقديم خدمة عملاء Facebook حيث يتوفر موظفون مؤهلون جيدًا لحل استفسارات العملاء على مدار 24 ساعة في اليوم.

_نقدا على خدمة التوصيل

لضمان رضا العملاء لنا وثقتهم بهم ، نحن نقدم خدمة الدفع عند التسليم بحيث يدفع العميل عند استلامه طلبها. باستخدام خدمة الدفع عند الاستلام ، نعطي العميل راحة وأمان أفضل للتعامل مع متجرنا.

واصل هو فريق من الناس المتحمسين والمتفانين من السودان. نحن نؤمن ببيئة عمل صحية. بقدر تركيزنا وقيادتنا في تحقيق الأهداف ، نحن أيضًا مدافعون عن مكان عمل ممتع ونشط. هذا ممكن فقط مع فريق مدهش ، نشط وديناميكي من الناس. إذا كنت تتفق مع معاييرنا ، وترغب في أن تكون جزءًا من خلية النحل الصاخبة هذه ، أرسل سيرتك الذاتية إلى careers@wasiil.net  </div>
</div>

@stop
