@extends('layouts.home')
@section('content')

   <div dir="rtl" class=" col-md-8" style="">
   <h3>الشروط والاحكام </h3>
   <br>
   <ol>
<li>الشركة لاتنظر لاي مشكلة لاي منتج بعد تسليمه بعد مرور 24ساعه </li>
<li>لايوجد تخفيض في اسعار المنتجات تتسلم الاسعار حسب الفاتوره المسجله باسم الشركه </li>
<li>التوصيل داخل المناطق المحدد لها 100 والتوصيل للولايات 300جنيه توصيل الولايات علي حسب الكرتونه </li>
<li>طريقة الدفع المتوفرة هي الدفع نقدا عند الاستلام
- يحق للزبون فحص المنتج والتأكد منه قبل الدفع
- تظهر طريقة الدفع عند الاستلام في صفحة اتمام الطلب.
- عند اتمام الطلب, يتم التواصل مع الزبون خلال مدة اقصاها 3 ايام وفي حال الفشل في التواصل مع الزبون هاتفيا لمدة تزيد عن 3 ايام يتم الغاء الطلب تلقائيا.
- يتم دفع نقدا بعملة الجنيه كما هو مبين في صفحة اتمام الطلب.</li>
</ol>
</div>

@stop